# USE CASE
## Create a student database stored as .sqlite
Inside the database, create three tables.

- One table for students = student_id, first_name, last_name, age, gender
- Second table for courses = course_id, course_name, credits
- Third table for enrollments = enrollment_id, student_id, course_id, enrollment_date, grade

Once complete, commit and close

In [2]:
# Import necessary libraries
import pandas as pd 
import sqlite3

In [3]:
# Create the database and the tables
conn = sqlite3.connect('student_database.sqlite')

#create a cursor object
cursor = conn.cursor()

In [4]:
# Create tables for student_details, course_details, and enrollment_details
cursor.execute("""
CREATE TABLE IF NOT EXISTS students (
    student_id INTEGER PRIMARY KEY,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    age INTEGER NOT NULL,
    gender TEXT NOT NULL CHECK(gender IN ('M', 'F'))
);
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL,
    credits INTEGER NOT NULL
);
""")
cursor.execute("""
CREATE TABLE IF NOT EXISTS enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id INTEGER NOT NULL,
    course_id INTEGER NOT NULL,
    enrollment_date TEXT NOT NULL,
    grade TEXT,
    FOREIGN KEY(student_id) REFERENCES students(student_id),
    FOREIGN KEY(course_id) REFERENCES courses(course_id)
);
""")

In [5]:
# Insert data into the tables
cursor.execute("""
INSERT INTO students (student_id, first_name, last_name, age, gender) VALUES
(1, 'Alice', 'Wanjiku', 22, 'F'),
(2, 'Brian', 'Omondi', 19, 'M'),
(3, 'Catherine', 'Mutheu', 25, 'F'),
(4, 'Daniel', 'Njoroge', 30, 'M'),
(5, 'Eva', 'Kiptoo', 18, 'F');
""")
conn.commit()

cursor.execute("""
INSERT INTO courses (course_id, course_name, credits) VALUES
(101, 'Mathematics', 3),
(102, 'Computer Science', 4),
(103, 'History', 2);
""")
conn.commit()

cursor.execute("""
INSERT INTO enrollments (enrollment_id, student_id, course_id, enrollment_date, grade) VALUES
(1001, 1, 101, '2024-03-01', 85),
(1002, 2, 102, '2024-03-02', 78),
(1003, 4, 103, '2024-03-03', 90);
""")
conn.commit()

In [ ]:
# Connect to the database (using both the terminal and python)
#terminal
conn = sqlite3.connect(r'C:\Users\Admin\Documents\Phase_2\SQL\student_database.sqlite')
#create a cursor
cursor = conn.cursor()

In [7]:
#Execute a query to fetch all students
cursor.execute('SELECT * FROM students')
rows = cursor.fetchall()
for row in rows:
    print(row)
#close the connection
conn.close()

(1, 'Alice', 'Wanjiku', 22, 'F')
(2, 'Brian', 'Omondi', 19, 'M')
(3, 'Catherine', 'Mutheu', 25, 'F')
(4, 'Daniel', 'Njoroge', 30, 'M')
(5, 'Eva', 'Kiptoo', 18, 'F')

In [8]:
# View the existing tables
# using sql query
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")
tables = cursor.fetchall()
for table in tables:
	print(table)

# How to view datatypes

('courses',)
('enrollments',)
('students',)

In [9]:
# Select all female students
cursor.execute("SELECT * FROM students WHERE gender = 'F';")
female_students = cursor.fetchall()
for student in female_students:
	print(student)

(1, 'Alice', 'Wanjiku', 22, 'F')
(3, 'Catherine', 'Mutheu', 25, 'F')
(5, 'Eva', 'Kiptoo', 18, 'F')

In [10]:
# Show the two oldest students
cursor.execute("""
SELECT * FROM students
ORDER BY age DESC
LIMIT 2;
""")
oldest_students = cursor.fetchall()
for student in oldest_students:
	print(student)

(4, 'Daniel', 'Njoroge', 30, 'M')
(3, 'Catherine', 'Mutheu', 25, 'F')

In [11]:
# Count the students per gender
cursor.execute("""
SELECT gender, COUNT(*) AS count
FROM students
GROUP BY gender;
""")
gender_counts = cursor.fetchall()
for gender_count in gender_counts:
	print(gender_count)

('F', 3)
('M', 2)

In [12]:
# Show the full names using an alias
cursor.execute("""
SELECT first_name || ' ' || last_name AS full_name
FROM students;
""")
full_names = cursor.fetchall()
for full_name in full_names:
	print(full_name)

('Alice Wanjiku',)
('Brian Omondi',)
('Catherine Mutheu',)
('Daniel Njoroge',)
('Eva Kiptoo',)

In [13]:
# Filter the data to show the age of students above 20
# Use both WHERE and HAVING as different queries
# Using WHERE clause
cursor.execute("""
SELECT *
FROM students
WHERE age > 20;
""")
students_above_20 = cursor.fetchall()
for student in students_above_20:
	print(student)

(1, 'Alice', 'Wanjiku', 22, 'F')
(3, 'Catherine', 'Mutheu', 25, 'F')
(4, 'Daniel', 'Njoroge', 30, 'M')

In [14]:
# Using HAVING clause
cursor.execute("""
SELECT age, COUNT(*) AS student_count
FROM students
GROUP BY age
HAVING age > 20;
""")
result = cursor.fetchall()
for row in result:
	print(row)

(22, 1)
(25, 1)
(30, 1)

In [15]:
# Use an inner join to show students with their course names
cursor.execute("""
SELECT s.student_id, s.first_name, s.last_name, c.course_name
FROM students s
INNER JOIN enrollments e ON s.student_id = e.student_id
INNER JOIN courses c ON e.course_id = c.course_id;
""")
result = cursor.fetchall()
for row in result:
	print(row)

(1, 'Alice', 'Wanjiku', 'Mathematics')
(2, 'Brian', 'Omondi', 'Computer Science')
(4, 'Daniel', 'Njoroge', 'History')

In [ ]:
# Find students not enrolled in any course
cursor.execute("""
SELECT s.student_id, s.first_name, s.last_name
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
WHERE e.course_id IS NULL;
""")
students_not_enrolled = cursor.fetchall()
for student in students_not_enrolled:
	print(student)

(3, 'Catherine', 'Mutheu')
(5, 'Eva', 'Kiptoo')

In [ ]:
# Perform all the joins
# Inner join
cursor.execute("""
SELECT s.student_id, s.first_name, c.course_name
FROM students s
INNER JOIN enrollments e ON s.student_id = e.student_id
INNER JOIN courses c ON e.course_id = c.course_id;
""")
result = cursor.fetchall()
for row in result:
	print(row)

# Left join
cursor.execute("""
SELECT s.student_id, s.first_name, c.course_name
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
LEFT JOIN courses c ON e.course_id = c.course_id;
""")
result = cursor.fetchall()
for row in result:
	print(row)

# Right Join 
cursor.execute("""
SELECT s.student_id, s.first_name, c.course_name
FROM courses c
LEFT JOIN enrollments e ON c.course_id = e.course_id
LEFT JOIN students s ON e.student_id = s.student_id;
""")
result = cursor.fetchall()
for row in result:
	print(row)

# Full outer join (simulated using UNION of LEFT JOIN and RIGHT JOIN)
cursor.execute("""
SELECT s.student_id, s.first_name, c.course_name
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
LEFT JOIN courses c ON e.course_id = c.course_id
UNION
SELECT s.student_id, s.first_name, c.course_name
FROM courses c
LEFT JOIN enrollments e ON c.course_id = e.course_id
LEFT JOIN students s ON e.student_id = s.student_id;
""")
result = cursor.fetchall()
for row in result:
	print(row)

In [ ]:
# Explain the relationships
# If not existing, add tables to help show all the relationships